app/controllers/pages_controller.rb

  def home
    @unfound = Post.where("found = ?", 'f')
    if @unfound != []
      @albums = Post.where("found = ?", 'f').order("created_at DESC").limit(9)
---
SELECT "posts".* FROM "posts" WHERE (found = 'f')
SELECT "posts".* FROM "posts" WHERE (found = 't') ORDER BY created_at DESC LIMIT 9

  def found
    @title = "Found sounds"

    @albums = Post.where("found = ?", 't').order("created_at DESC").limit(9)
---
SELECT "posts".* FROM "posts" WHERE (found = 't') ORDER BY created_at DESC LIMIT 9

  def city_unfound
    @city = (params[:city]).capitalize.gsub("-", " ")
    @title = "Unfound sounds in #{@city}"

    @albums = Post.where("found = ?", 'f').where("city = ?", params[:city]).order("created_at DESC").limit(9)
---
SELECT "posts".* FROM "posts" WHERE (found = 'f') AND (city = 'omaha') ORDER BY created_at DESC LIMIT 9

  def album
    @album = Post.find_by_url(params[:url])
    @title = "#{@album.album_title}"
    @album_city = Post.where("found = ?", 'f').where("city = ?", @album.city).where("id != ?", @album.id)
---
SELECT "posts".* FROM "posts" WHERE "posts"."url" = 'all-delighted-people-by-sufjan-stevens' LIMIT 1
SELECT "posts".* FROM "posts" WHERE (found = 'f') AND (city = 'Lincoln') AND (id != 1)

  def edit
    @album = Post.find_by_url(params[:url])
---
SELECT "posts".* FROM "posts" WHERE "posts"."url" = 'all-delighted-people-by-sufjan-stevens' LIMIT 1

  def save_album
    album_title = params[:album_title]
    album_cover = params[:album_cover]
    album_review = params[:album_review]
    place_title = params[:place_title]
    place_description = params[:place_description]
    pinpoint_description = params[:pinpoint_description]
    rdio = params[:rdio]
    city = params[:city]
    hidden_place = params[:hidden_place]
    map = params[:map]
    pinpoint_map = params[:pinpoint_map]

    album = Post.new({
      :album_title => album_title,
      :album_cover => album_cover,
      :album_review => album_review,
      :place_title => place_title,
      :place_description => place_description,
      :pinpoint_description => pinpoint_description,
      :rdio => rdio,
      :city => city,
      :hidden_place => hidden_place,
      :map => map,
      :pinpoint_map => pinpoint_map,
      :found => 0,
      :url => "#{album_title.gsub(' ', '-').gsub(/[^\w-]/, '').downcase}"
      })
    album.save
---
INSERT INTO "posts" ("album_cover", "album_review", "album_title", "city", "created_at", "found", "hidden_place", "map", "pinpoint_description", "pinpoint_map", "place_description", "place_title", "rdio", "updated_at", "url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"

  def edit_album
    album_title = params[:album_title]
    album_cover = params[:album_cover]
    album_review = params[:album_review]
    place_title = params[:place_title]
    place_description = params[:place_description]
    pinpoint_description = params[:pinpoint_description]
    rdio = params[:rdio]
    city = params[:city]
    hidden_place = params[:hidden_place]
    map = params[:map]
    pinpoint_map = params[:pinpoint_map]

    album = Post.find_by_url(params[:url])
---
SELECT "posts".* FROM "posts" WHERE "posts"."url" = 'all-delighted-people-by-sufjan-stevens' LIMIT 1